# SetValue Method (Double)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleFilter..::..SetValue Method (Double)
ScheduleFilter Class See Also
---
Set the filter value to a double.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void SetValue(
	double value
)
```

Visual Basic
---
```text
Public Sub SetValue ( _
	value As Double _
)
```

Visual C++
---
```text
public:
void SetValue(
	double value
)
```

# ### Parameters
value
    Type: System..::..Double The filter value.
# See Also
ScheduleFilter Class
SetValue Overload
Autodesk.Revit.DB Namespace